In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.read_csv(filepath_or_buffer='../../pandas-workout-data/data/nyc-temps.txt').squeeze()
s

0     -1
1     -1
2     -1
3     -1
4     -1
      ..
723    2
724    2
725    2
726    2
727    2
Name: -1, Length: 728, dtype: int64

In [3]:
df = pd.DataFrame(data={
    'temp': s,
    'hour': [0,3,6,9,12,15,18,21] * 91
})
df

     temp  hour
0      -1     0
1      -1     3
2      -1     6
3      -1     9
4      -1    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [4]:
df.loc[df['temp'] < 0, 'temp'] = 0
df

     temp  hour
0       0     0
1       0     3
2       0     6
3       0     9
4       0    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [5]:
df.describe()

             temp        hour
count  728.000000  728.000000
mean     1.431319   10.500000
std      2.378424    6.878589
min      0.000000    0.000000
25%      0.000000    5.250000
50%      0.000000   10.500000
75%      2.000000   15.750000
max     12.000000   21.000000

### Beyond the exercise

Set all the odd temperatures to the mean of all temperatures

In [6]:
df['temp'] = df['temp'].astype(np.float64)
df['temp']

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
723    2.0
724    2.0
725    2.0
726    2.0
727    2.0
Name: temp, Length: 728, dtype: float64

In [7]:
mean_temp = df['temp'].mean()
mean_temp

np.float64(1.4313186813186813)

In [8]:
df.loc[df['temp'] % 2 != 0]

     temp  hour
7     1.0    21
8     1.0     0
9     1.0     3
10    1.0     6
11    1.0     9
..    ...   ...
602   3.0     6
603   3.0     9
604   3.0    12
605   3.0    15
606   3.0    18

[192 rows x 2 columns]

In [9]:
df.loc[df['temp'] % 2 != 0, 'temp'] = mean_temp

In [10]:
df.head(10)

       temp  hour
0  0.000000     0
1  0.000000     3
2  0.000000     6
3  0.000000     9
4  0.000000    12
5  0.000000    15
6  0.000000    18
7  1.431319    21
8  1.431319     0
9  1.431319     3

Set the even temperatures at hours 9 and 18 to 3

In [11]:
df

     temp  hour
0     0.0     0
1     0.0     3
2     0.0     6
3     0.0     9
4     0.0    12
..    ...   ...
723   2.0     9
724   2.0    12
725   2.0    15
726   2.0    18
727   2.0    21

[728 rows x 2 columns]

In [12]:
df.loc[(df['temp'] % 2 == 0) & (df['hour'].isin([9 ,18])), 'temp'] = 3
df

     temp  hour
0     0.0     0
1     0.0     3
2     0.0     6
3     3.0     9
4     0.0    12
..    ...   ...
723   3.0     9
724   2.0    12
725   2.0    15
726   3.0    18
727   2.0    21

[728 rows x 2 columns]

If the hour is odd, set the temperature to 5.

In [13]:
df

     temp  hour
0     0.0     0
1     0.0     3
2     0.0     6
3     3.0     9
4     0.0    12
..    ...   ...
723   3.0     9
724   2.0    12
725   2.0    15
726   3.0    18
727   2.0    21

[728 rows x 2 columns]

In [14]:
df.loc[df['hour'] % 2 != 0, 'temp'] = 5

In [15]:
df

     temp  hour
0     0.0     0
1     5.0     3
2     0.0     6
3     5.0     9
4     0.0    12
..    ...   ...
723   5.0     9
724   2.0    12
725   5.0    15
726   3.0    18
727   5.0    21

[728 rows x 2 columns]